---
type: RoutingConditions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# RoutingConditions

`Autodesk.Revit.DB.RoutingConditions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RoutingConditions | 2013 | `public RoutingConditions ( RoutingPreferenceErrorLevel errorLevel )` |
| Method | AppendCondition | 2013 | `public void AppendCondition ( RoutingCondition condition )` |
| Method | Clear | 2013 | `public void Clear ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetConditionAt | 2013 | `public RoutingCondition GetConditionAt ( int index )` |
| Method | GetNumberOfConditions | 2013 | `public int GetNumberOfConditions ()` |
| Property | ErrorLevel | 2013 | `public RoutingPreferenceErrorLevel ErrorLevel { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PreferredJunctionType | 2013 | `public PreferredJunctionType PreferredJunctionType { get ; set ; }` |